CSI API ETABS v1
cFrameObj.AddByCoord Method
 Adds a new frame object whose end points are at the specified coordinates.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddByCoord(
	double XI,
	double YI,
	double ZI,
	double XJ,
	double YJ,
	double ZJ,
	ref string Name,
	string PropName = "Default",
	string UserName = "",
	string CSys = "Global"
)
Function AddByCoord (
	XI As Double,
	YI As Double,
	ZI As Double,
	XJ As Double,
	YJ As Double,
	ZJ As Double,
	ByRef Name As String,
	Optional PropName As String = "Default",
	Optional UserName As String = "",
	Optional CSys As String = "Global"
) As Integer
Dim instance As cFrameObj
Dim XI As Double
Dim YI As Double
Dim ZI As Double
Dim XJ As Double
Dim YJ As Double
Dim ZJ As Double
Dim Name As String
Dim PropName As String
Dim UserName As String
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.AddByCoord(XI,
	YI, ZI, XJ, YJ, ZJ, Name, PropName, UserName,
	CSys)
int AddByCoord(
	double XI,
	double YI,
	double ZI,
	double XJ,
	double YJ,
	double ZJ,
	String^% Name,
	String^ PropName = L"Default",
	String^ UserName = L"",
	String^ CSys = L"Global"
)
abstract AddByCoord :
        XI : float *
        YI : float *
        ZI : float *
        XJ : float *
        YJ : float *
        ZJ : float *
        Name : string byref *
        ?PropName : string *
        ?UserName : string *
        ?CSys : string
(* Defaults:
        let _PropName = defaultArg PropName "Default"
        let _UserName = defaultArg UserName ""
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
XI
Type: System.Double
 The coordinates of the I-End of the added frame object. The coordinates are in the coordinate system defined by the CSys item.
YI
Type: System.Double
 The coordinates of the I-End of the added frame object. The coordinates are in the coordinate system defined by the CSys item.
ZI
Type: System.Double
 The coordinates of the I-End of the added frame object. The coordinates are in the coordinate system defined by the CSys item.
XJ
Type: System.Double
 The coordinates of the J-End of the added frame object. The coordinates are in the coordinate system defined by the CSys item.
YJ
Type: System.Double
 The coordinates of the J-End of the added frame object. The coordinates are in the coordinate system defined by the CSys item.
ZJ
Type: System.Double
 The coordinates of the J-End of the added frame object. The coordinates are in the coordinate system defined by the CSys item.
Name
Type: System.String
 This is the name that the program ultimately assigns for the frame object. If no userName is specified, the program assigns a default name to the frame object. If a userName is specified and that name is not used for another frame, cable or tendon object, the userName is assigned to the frame object, otherwise a default name is assigned to the frame object.
PropName (Optional)
Type: System.String
 This is Default, None, or the name of a defined frame section property.
 If it is Default, the program assigns a default section property to the frame object. If it is None, no section property is assigned to the frame object. If it is the name of a defined frame section property, that property is assigned to the frame object.
UserName (Optional)
Type: System.String
 This is an optional user specified name for the frame object. If a UserName is specified and that name is already used for another frame object, the program ignores the UserName.
CSys (Optional)
Type: System.String
 The name of the coordinate system in which the frame object end point coordinates are defined.
Return Value
Type: Int32
 Returns zero if the frame object is successfully added, otherwise it returns a nonzero value.
Remarks
 Note that the End I and End J joints of the added frame object are determined based on the orientation of the object and may not be the same order as specified in the parameters of this API functions. Please use GetPoints(String, String, String) to check the position of the End I and End J joints.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Name As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel(eUnits.lb_ft_F)
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add frame object by coordinates
   ret = SapModel.FrameObj.AddByCoord(0, 72, 48, 0, 48, 36, Name)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace